Public Attributes | List of all members
API_ArrowData Struct Reference
Element Manager
Describes the arrows at line ends. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_ArrowID  | arrowType
Type of the arrow.
 bool  | begArrow
Put arrow to the beginning?
 bool  | endArrow
Put arrow to the end?
 short  | arrowPen
Pen attribute index for the arrows.
 double  | arrowSize
Arrow size in mm.
Detailed Description
Describes the arrows at line ends.